<font color="blue" size="6">Merging Data</font>

<p>The merge() method updates the content of two DataFrame by merging them together.
<p>Use the parameters to control which values to keep and which to replace.

In [4]:
import pandas as pd
import numpy as np
S1=pd.read_csv('DATASETS\\Student1.csv')
S2=pd.read_csv('DATASETS\\Student2.csv')

In [5]:
S1 = pd.DataFrame(S1)
S2 = pd.DataFrame(S2)

In [6]:
S1

   ID   Name  Marks
0   1   Raja     90
1   2    Sam     65
2   3   Hema     88
3   7  Helen     86
4   9   Riya     77

In [7]:
S2

   ID   Name  Rank  Height  Weight
0   1   Raja     2     160      61
1   2    Sam     3     168      69
2   3   Hema     1     158      54
3   4  Nisha     4     159      55
4   5   BABA     6     170      72

In [8]:
pd.merge(S1,S2,on='Name')

   ID_x  Name  Marks  ID_y  Rank  Height  Weight
0     1  Raja     90     1     2     160      61
1     2   Sam     65     2     3     168      69
2     3  Hema     88     3     1     158      54